; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 912489 1 3 2 4 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Planet4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
)
(:goal (and
	(have_image Planet4 spectrograph1)
	(have_image Planet5 spectrograph1)
	(have_image Phenomenon6 spectrograph1)
	(have_image Phenomenon7 spectrograph1)
	(have_image Phenomenon8 infrared0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation3 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 planet5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet5)
   goals met: 0 of 5
5. (take_image satellite0 planet5 instrument1 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 1 of 5
6. (turn_to satellite0 planet4 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet4)
   goals met: 1 of 5
7. (take_image satellite0 planet4 instrument1 spectrograph1)
   added: (have_image planet4 spectrograph1)
   goals met: 2 of 5
8. (turn_to satellite0 phenomenon8 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 5
9. (take_image satellite0 phenomenon8 instrument1 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 3 of 5
10. (turn_to satellite0 phenomenon7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 5
11. (take_image satellite0 phenomenon7 instrument1 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 4 of 5
12. (turn_to satellite0 phenomenon6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 5
13. (take_image satellite0 phenomenon6 instrument1 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 5 of 5
